---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMustBeUniqueWarn
source: html/f39d2629-bc00-f10e-a0f7-1bbff7c84cbb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMustBeUniqueWarn Property

Element must be unique.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyMustBeUniqueWarn { get; }
```